In [2]:
import pandas as pd
import numpy as np

In [25]:
x = ['a','b','c','d','e']
x1 = ['a','b','c','d','f']
y = [1,2,3,4,5]
z = {9:'a',2:'b',3:'c',4:'d',5:'e'}

In [9]:
a=pd.Series(data=x,index=y)
a

1    a
2    b
3    c
4    d
5    e
dtype: object

In [10]:
type(a)

pandas.core.series.Series

In [12]:
pd.Series(z)

9    a
2    b
3    c
4    d
5    e
dtype: object

In [26]:
a = pd.Series(y,x)
b = pd.Series(y,x)
c = pd.Series(y,x1) 
print(a+b)
print("-----------------------")
print(a+c)

a     2
b     4
c     6
d     8
e    10
dtype: int64
-----------------------
a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
f    NaN
dtype: float64

In [27]:
a['c':]

c    3
d    4
e    5
dtype: int64

In [4]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9,0,1,2]
D = [3,4,5,6]
E = [7,8,9,0]

In [10]:
df = pd.DataFrame((A,B,C,D,E),['a','b'],['w','x'])
df

ValueError: 2 columns passed, passed data had 4 columns

In [33]:
print('🕶')

🕶

In [62]:
df = pd.DataFrame((A,B,C,D,E),['a','b','c','d','e'],['W','X','Y','Z'])
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [63]:
df['A'] = df['Y'] + df['Z']
df

   W  X  Y  Z   A
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [64]:
df.drop('e')

   W  X  Y  Z   A
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [57]:
df

   W  X  Y  Z   A
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [65]:
df.drop('d',inplace=True)

In [66]:
df

   W  X  Y  Z   A
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
e  7  8  9  0   9

In [67]:
df.drop('A',axis=1,inplace=True)
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
e  7  8  9  0

In [68]:
df = pd.DataFrame((A,B,C,D,E),['a','b','c','d','e'],['W','X','Y','Z'])
df

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [69]:
df['Y']

a    3
b    7
c    1
d    5
e    9
Name: Y, dtype: int64

In [71]:
df.loc['a']

W    1
X    2
Y    3
Z    4
Name: a, dtype: int64

In [74]:
df.iloc[0]

W    1
X    2
Y    3
Z    4
Name: a, dtype: int64

In [75]:
df.loc['d','Y']

5

In [77]:
df>3

       W      X      Y      Z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True
e   True   True   True  False

In [78]:
df[df>3]

     W    X    Y    Z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0
e  7.0  8.0  9.0  NaN

In [79]:
df[df['W']>3]

   W  X  Y  Z
b  5  6  7  8
c  9  0  1  2
e  7  8  9  0

In [80]:
df[df['W']>3] ['W']

b    5
c    9
e    7
Name: W, dtype: int64

In [83]:
df[df['W']>3] [['W','Y']]

   W  Y
b  5  7
c  9  1
e  7  9

In [98]:
df[ (df['W']>3) & (df['Y']>0) ]

   W  X  Y  Z
b  5  6  7  8
c  9  0  1  2
e  7  8  9  0

In [99]:
df[ (df['W']>3) | (df['Y']>0) ]

   W  X  Y  Z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [100]:
df[ (df['W']>30) & (df['Y']>30) ]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [101]:
df ={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[3,4,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]
}
df

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [103]:
df = pd.DataFrame(df)
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [104]:
df.dropna(axis=0)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [105]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [111]:
df.dropna(thresh=2)   #it means more than 2 values are avaialble in row

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN

In [112]:
df.fillna('1') #nan replaced by 1

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0    1
2  3  8.0  2.0    1    1
3  4  9.0    1    1    1
4  5    1    1    1    1

In [114]:
df['b'].fillna(df['b'].mean())   #stats basics to replace nan by avg

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

In [120]:
p = {'item':['apple','apple','orange','orange','guns','guns','guns'],'days':['mon','tue','wed','thru','fri','sat','sun'],'sales':[100,80,200,100,5,10,5]}
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thru', 'fri', 'sat', 'sun'],
 'sales': [100, 80, 200, 100, 5, 10, 5]}

In [121]:
df = pd.DataFrame(p)
df

     item  days  sales
0   apple   mon    100
1   apple   tue     80
2  orange   wed    200
3  orange  thru    100
4    guns   fri      5
5    guns   sat     10
6    guns   sun      5

In [122]:
x = df.groupby('item')
x

In [124]:
x.mean()

/tmp/ipykernel_2567/3791599204.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.mean()

             sales
item
apple    90.000000
guns      6.666667
orange  150.000000

In [125]:
x.sum()

/tmp/ipykernel_2567/2925620302.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x.sum()

        sales
item
apple     180
guns       20
orange    300

In [126]:
x.count()

        days  sales
item
apple      2      2
guns       3      3
orange     2      2

In [127]:
x.describe()

       sales
       count        mean        std    min    25%    50%    75%    max
item
apple    2.0   90.000000  14.142136   80.0   85.0   90.0   95.0  100.0
guns     3.0    6.666667   2.886751    5.0    5.0    5.0    7.5   10.0
orange   2.0  150.000000  70.710678  100.0  125.0  150.0  175.0  200.0

In [128]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   3.000000    2.000000
      mean    90.000000   6.666667  150.000000
      std     14.142136   2.886751   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   5.000000  125.000000
      50%     90.000000   5.000000  150.000000
      75%     95.000000   7.500000  175.000000
      max    100.000000  10.000000  200.000000

In [129]:
x1 = {'a':[1,2,3], 'b':[5,6,7]}
y1 = {'c':[3,4,5], 'd':[2,3,6]}

In [138]:
x = pd.DataFrame(x1,index=['p1','p2','p3'])
y = pd.DataFrame(y1,index=['p1','p4','p5'])

In [139]:
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [140]:
y

    c  d
p1  3  2
p4  4  3
p5  5  6

In [141]:
x.join(y)

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  NaN  NaN

In [142]:
x.join(y,how='right')       # inner and outer are also there with left

      a    b  c  d
p1  1.0  5.0  3  2
p4  NaN  NaN  4  3
p5  NaN  NaN  5  6

In [143]:
x.join(y,how='outer')

      a    b    c    d
p1  1.0  5.0  3.0  2.0
p2  2.0  6.0  NaN  NaN
p3  3.0  7.0  NaN  NaN
p4  NaN  NaN  4.0  3.0
p5  NaN  NaN  5.0  6.0

In [144]:
x.join(y,how='inner')

    a  b  c  d
p1  1  5  3  2

In [5]:
x1 = {'a':[1,1,1,1,1],'b':[1,1,1,1,1],'c':[1,1,1,1,1],'d':[1,1,1,1,1],'e':[1,1,1,1,1]}
x2 = {'e':[2,2,2,2,2],'f':[2,2,2,2,2],'g':[2,2,2,2,2],'h':[2,2,2,2,2],'i':[2,2,2,2,2]}
x3 = {'a':[3,3,3,3,3],'b':[3,3,3,3,3],'c':[3,3,3,3,3],'d':[3,3,3,3,3],'e':[3,3,3,3,3]}

In [9]:
df1 = pd.DataFrame(x1,index= [1,2,3,4,5])
df2 = pd.DataFrame(x2,index= [1,2,3,4,5])
df3 = pd.DataFrame(x3,index= [5,6,7,8,9])

In [17]:
df3

   a  b  c  d  e
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [19]:
pd.concat([df1,df2])

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0

In [23]:
pd.concat([df1,df3],axis=1)

     a    b    c    d    e    a    b    c    d    e
1  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  3.0  3.0  3.0  3.0  3.0
6  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
7  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
8  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
9  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0

In [22]:
pd.concat([df1,df3],axis=0)

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [35]:
df1 = pd.DataFrame({'key':[1,2,3],'b':[2,3,4],'a':[5,6,7]})
df2 = pd.DataFrame({'d':[1,2,3],'c':[2,3,4],'a':[5,6,7]})

In [36]:
pd.merge(df1,df2,how='inner',on='a')

   key  b  a  d  c
0    1  2  5  1  2
1    2  3  6  2  3
2    3  4  7  3  4

In [ ]:
.index
.columns

.apply(fun)
.sum()
.sort_values(by=)

.unique()
.nunique()
.value_counts()
.isnull()

In [38]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [40]:
df1.columns

Index(['key', 'b', 'a'], dtype='object')

In [42]:
df1['a'].sum()

18

In [43]:
def inc(df1):
    df1 = df1+100
    return df1

In [44]:
df1['a'].apply(inc)

0    105
1    106
2    107
Name: a, dtype: int64

In [47]:
df1.sort_values('a')

   key  b  a
0    1  2  5
1    2  3  6
2    3  4  7

In [53]:
df1['a'].unique()

array([5, 6, 7])

In [54]:
df1['a'].nunique()

3

In [55]:
df1['a'].value_counts()

5    1
6    1
7    1
Name: a, dtype: int64

In [56]:
df1['a'].isnull()

0    False
1    False
2    False
Name: a, dtype: bool

In [ ]:
json
csv/excel
html
sql

In [2]:
pwd

'/media/deepak/ssd/Users/Dell/PRACTISE'

In [5]:
ok = pd.read_csv('sample.csv')
ok

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
20636,BDCQ.SEE3999A,2017.06,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20637,BDCQ.SEE3999A,2017.09,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20638,BDCQ.SEE3999A,2017.12,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20639,BDCQ.SEE3999A,2018.03,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
20640,BDCQ.SEE3999A,2018.06,NaN,Y,C,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [6]:
import seaborn as ss

In [11]:
x = ss.load_dataset('sample.csv')

ValueError: 'sample.csv' is not one of the example datasets.